<a href="https://colab.research.google.com/github/temple17/python-for-data-analysis-2nd-edition/blob/main/Chapter7_(p_209~237).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

## Chapter 7. Data Cleaning and Preparation

In [ ]:
# 7.1 Handling Missing Data

In [ ]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [ ]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [ ]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [ ]:
string_data[0] = None

In [ ]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [ ]:
from numpy import nan as NA

In [ ]:
data = pd.Series([1,NA,3.5,NA,7])

In [ ]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [ ]:
cleaned = data.dropna()

In [ ]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [ ]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
data[4] = NA

In [ ]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [ ]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
df = pd.DataFrame(np.random.randn(7,3))

In [ ]:
df.iloc[:4, 1] = NA

In [ ]:
df.iloc[:2, 2] = NA

In [ ]:
df

          0         1         2
0 -0.222547       NaN       NaN
1  0.790298       NaN       NaN
2 -0.018265       NaN -1.408619
3  0.388678       NaN  0.160973
4 -0.553226 -1.844799 -0.389269
5 -0.544471  0.023996 -1.520885
6 -1.158734 -0.379442 -1.031515

In [ ]:
df.dropna(thresh = 2)

          0         1         2
2 -0.018265       NaN -1.408619
3  0.388678       NaN  0.160973
4 -0.553226 -1.844799 -0.389269
5 -0.544471  0.023996 -1.520885
6 -1.158734 -0.379442 -1.031515

In [ ]:
# Filling in Missing data

df.fillna(0)

          0         1         2
0 -0.222547  0.000000  0.000000
1  0.790298  0.000000  0.000000
2 -0.018265  0.000000 -1.408619
3  0.388678  0.000000  0.160973
4 -0.553226 -1.844799 -0.389269
5 -0.544471  0.023996 -1.520885
6 -1.158734 -0.379442 -1.031515

In [ ]:
df.fillna({1: 0.5, 2:0})

          0         1         2
0 -0.222547  0.500000  0.000000
1  0.790298  0.500000  0.000000
2 -0.018265  0.500000 -1.408619
3  0.388678  0.500000  0.160973
4 -0.553226 -1.844799 -0.389269
5 -0.544471  0.023996 -1.520885
6 -1.158734 -0.379442 -1.031515

In [ ]:
_ = df.fillna(0, inplace = True)

In [ ]:
df

          0         1         2
0 -0.222547  0.000000  0.000000
1  0.790298  0.000000  0.000000
2 -0.018265  0.000000 -1.408619
3  0.388678  0.000000  0.160973
4 -0.553226 -1.844799 -0.389269
5 -0.544471  0.023996 -1.520885
6 -1.158734 -0.379442 -1.031515

In [ ]:
df = pd.DataFrame(np.random.randn(6,3))

In [ ]:
df.iloc[2:, 1] = NA

In [ ]:
df.iloc[4:, 2] = NA

In [ ]:
df

          0         1         2
0 -0.765450  1.302008  0.801479
1  0.049726 -1.229328 -0.295732
2 -0.337462       NaN -1.042034
3  0.109452       NaN  0.986689
4  2.002633       NaN       NaN
5  0.040939       NaN       NaN

In [ ]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.765450  1.302008  0.801479
1  0.049726 -1.229328 -0.295732
2 -0.337462 -1.229328 -1.042034
3  0.109452 -1.229328  0.986689
4  2.002633 -1.229328  0.986689
5  0.040939 -1.229328  0.986689

In [ ]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0 -0.765450  1.302008  0.801479
1  0.049726 -1.229328 -0.295732
2 -0.337462 -1.229328 -1.042034
3  0.109452 -1.229328  0.986689
4  2.002633       NaN  0.986689
5  0.040939       NaN  0.986689

In [ ]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [ ]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [ ]:
# 7.2 Data Transformation

data = pd.DataFrame({'k1' : ['one','two'] * 3 + ['two'],
                     'k2' : [1, 1, 2, 3, 3, 4, 4]})

In [ ]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [ ]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [ ]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [ ]:
data['v1'] = range(7)

In [ ]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [ ]:
data.drop_duplicates(['k1','k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [ ]:
data = pd.DataFrame({'food' : ['bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                               'pastrami', 'honey ham', 'nova lox'],
                     'ounces' : [4,3,12,6,7.5,8,3,5,6]})

In [ ]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [ ]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork' : 'pig',
    'pastrami' : 'cow',
    'corned beef' : 'cow',
    'honey ham' : 'pig',
    'nova lox' : 'salmon'
}

In [ ]:
lowercased = data['food'].str.lower()

In [ ]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [ ]:
data['animal'] = lowercased.map(meat_to_animal)

In [ ]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [ ]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [ ]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [ ]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [ ]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [ ]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [ ]:
data.replace([-999,-1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index = ['Ohio', 'Colorado', 'New York'],
                    columns =['one', 'two', 'three', 'four'])

In [ ]:
transform = lambda x : x[:4].upper()

In [ ]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [ ]:
data.index = data.index.map(transform)

In [ ]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [ ]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [ ]:
data.rename(index = {'OHIO': 'INDIANA'},
            columns = {'three' : 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [ ]:
data.rename(index = {'OHIO' : 'INDIANA'}, inplace = True)

In [ ]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [ ]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [ ]:
bins = [18,25,35,60,100]

In [ ]:
cats = pd.cut(ages, bins)

In [ ]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [ ]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [ ]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [ ]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
pd.cut(ages, [18, 26, 36, 61, 100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [ ]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [ ]:
pd.cut(ages, bins, labels = group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [ ]:
data = np.random.rand(20)

In [ ]:
pd.cut(data, 4 , precision=2)

[(0.027, 0.27], (0.75, 1.0], (0.27, 0.51], (0.27, 0.51], (0.27, 0.51], ..., (0.27, 0.51], (0.75, 1.0], (0.27, 0.51], (0.027, 0.27], (0.027, 0.27]]
Length: 20
Categories (4, interval[float64]): [(0.027, 0.27] < (0.27, 0.51] < (0.51, 0.75] < (0.75, 1.0]]

In [ ]:
data = np.random.randn(1000)

In [ ]:
cats = pd.qcut(data, 4)

In [ ]:
cats

[(-0.673, 0.00717], (-2.606, -0.673], (-2.606, -0.673], (-0.673, 0.00717], (0.666, 3.323], ..., (-2.606, -0.673], (0.666, 3.323], (-0.673, 0.00717], (0.666, 3.323], (-0.673, 0.00717]]
Length: 1000
Categories (4, interval[float64]): [(-2.606, -0.673] < (-0.673, 0.00717] < (0.00717, 0.666] <
                                    (0.666, 3.323]]

In [ ]:
pd.value_counts(cats)

(0.666, 3.323]       250
(0.00717, 0.666]     250
(-0.673, 0.00717]    250
(-2.606, -0.673]     250
dtype: int64

In [ ]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.322, 0.00717], (-1.322, 0.00717], (-1.322, 0.00717], (-1.322, 0.00717], (0.00717, 1.215], ..., (-1.322, 0.00717], (0.00717, 1.215], (-1.322, 0.00717], (0.00717, 1.215], (-1.322, 0.00717]]
Length: 1000
Categories (4, interval[float64]): [(-2.606, -1.322] < (-1.322, 0.00717] < (0.00717, 1.215] <
                                    (1.215, 3.323]]

In [2]:
# Detecting and Filtering Outliers

In [5]:
data = pd.DataFrame(np.random.randn(1000,4))

In [6]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.053820     0.029954     0.006890     0.067708
std       1.003725     1.002862     1.012244     1.012162
min      -3.280412    -3.406870    -3.002306    -3.730057
25%      -0.640120    -0.663409    -0.655153    -0.648826
50%       0.001498     0.064613     0.015594     0.059307
75%       0.710604     0.683607     0.639582     0.736663
max       3.540852     4.165240     3.354868     3.402641

In [7]:
col = data[2]

In [8]:
col[np.abs(col) > 3]

126    3.078669
196   -3.002306
419    3.204711
585    3.275855
590    3.354868
796    3.046400
Name: 2, dtype: float64

In [9]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
126  0.757635 -1.046998  3.078669  1.326363
150  1.073289 -0.790831  1.372924  3.029469
196  0.153695  0.131425 -3.002306  0.638829
281  3.540852  0.760934  0.645527 -1.245264
419  1.409408  1.101204  3.204711 -1.173493
430 -0.012217  4.165240 -0.803559  0.459776
453  0.225800 -1.364650  0.390038 -3.052120
512 -1.469835  1.013463  1.210711  3.326854
560 -0.483707 -0.518571  0.393476 -3.730057
585 -0.314117  0.901714  3.275855  1.081674
590  0.087171  0.931954  3.354868  0.796783
725 -0.896801  3.617706  1.400022 -0.034510
796  1.892298 -0.228030  3.046400  1.457873
819 -0.161185 -0.569687  2.553314  3.402641
917  0.445853 -3.406870  0.343639  0.058448
929 -3.280412 -0.744674 -0.031868 -1.618928

In [10]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [11]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.053559     0.028578     0.005932     0.067732
std       1.001094     0.995366     1.009265     1.007177
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.640120    -0.663409    -0.655153    -0.648826
50%       0.001498     0.064613     0.015594     0.059307
75%       0.710604     0.683607     0.639582     0.736663
max       3.000000     3.000000     3.000000     3.000000

In [12]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0 -1.0 -1.0  1.0
2 -1.0  1.0  1.0  1.0
3 -1.0 -1.0 -1.0 -1.0
4 -1.0 -1.0  1.0  1.0

In [13]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))

In [14]:
sampler = np.random.permutation(5)

In [15]:
sampler

array([4, 1, 3, 0, 2])

In [16]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [18]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11

In [19]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [21]:
choices = pd.Series([5,7,-1,6,4])

In [24]:
draws = choices.sample(n = 10, replace = True)

In [25]:
draws

4    4
4    4
2   -1
4    4
2   -1
3    6
3    6
0    5
3    6
2   -1
dtype: int64

In [26]:
df = pd.DataFrame({'key' : ['b','b','a','c','a','b'],
                   'data1' : range(6)})

In [27]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [28]:
dummies = pd.get_dummies(df['key'], prefix = 'key')

In [29]:
df_with_dummy = df[['data1']].join(dummies)

In [30]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [31]:
mnames = ['movie_id', 'title', 'genres']

In [33]:
movies = pd.read_table('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/datasets/movielens/movies.dat', sep = '::', header = None, names = mnames)

/usr/local/lib/python3.7/dist-packages/pandas/io/parsers.py:767: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return read_csv(**locals())

In [34]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [35]:
all_genres = []

In [36]:
for x in movies['genres']:
    all_genres.extend(x.split('|'))

In [37]:
genres = pd.unique(all_genres)

In [38]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [39]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [40]:
dummies = pd.DataFrame(zero_matrix, columns = genres)

In [41]:
gen = movies.genres[0]

In [42]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [43]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [49]:
for i, gen in enumerate(movies['genres']):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [50]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [51]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [52]:
np.random.seed(12345)

In [53]:
values = np.random.rand(10)

In [54]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [55]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [56]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [57]:
# 7.3 String Manipulation

In [58]:
# String Object Methods

In [59]:
val = 'a,b,   guido'

In [60]:
val.split(',')

['a', 'b', '   guido']

In [62]:
pieces = [x.strip() for x in val.split(',')]

In [63]:
pieces

['a', 'b', 'guido']

In [66]:
first, second, third = pieces

In [67]:
first + '::' + second + '::' + third

'a::b::guido'

In [68]:
'::'.join(pieces)

'a::b::guido'

In [69]:
'guido' in val

True

In [70]:
val.index(',')

1

In [71]:
val.find(':')

-1

In [72]:
val.index(':')

ValueError: ignored

In [73]:
val.count(',')

2

In [74]:
val.replace(',', '::')

'a::b::   guido'

In [75]:
val.replace(',', '')

'ab   guido'

In [76]:
# Regular Expression

In [77]:
import re

In [78]:
text = 'foo     bar baz     qux'

In [79]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [80]:
regex = re.compile('\s+')

In [81]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [82]:
regex.findall(text)

['     ', ' ', '     ']

In [83]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [86]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [87]:
# re.IGNORECASE makes the regex case-insensitive

regex = re.compile(pattern, flags = re.IGNORECASE)

In [88]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [89]:
m = regex.search(text)

In [90]:
m

In [91]:
text[m.start():m.end()]

'dave@google.com'

In [92]:
print(regex.match(text))

None

In [93]:
print(regex.sub('REACTED', text))

Dave REACTED
Steve REACTED
Rob REACTED
Ryan REACTED

In [94]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [95]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [96]:
m = regex.match('wesm@bring.net')

In [97]:
m.groups()

('wesm', 'bring', 'net')

In [98]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [99]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [100]:
# Vectorized String Functions in pandas

In [101]:
data = {'Dave' : 'dave@google.com', 'Steve' : 'steve@gmail.com',
        'Rob' : 'rob@gmail.com', 'Wes' : np.nan}

In [102]:
data = pd.Series(data)

In [103]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [104]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [105]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [106]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [107]:
data.str.findall(pattern, flags = re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [108]:
matches = data.str.match(pattern, flags = re.IGNORECASE)

In [109]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [112]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object